---
kind: other
id: Properties.T:Autodesk.Revit.DB.CompoundStructureLayer
source: html/dddeea50-bdcc-e8c6-6096-1bcaee7cedb1.htm
---
# CompoundStructureLayer Properties

Embedding type for structural deck - only for a layer whose function is StructuralDeck.